{
  "Understanding Number Bases": "## Understanding Number Bases\r\n- Binary means composed of two parts, only using digits 0 and 1.\r\n- Decimal numbers are more commonly used, composed of digits 0 through 9.\r\n- Different cultures have used various numeral systems to record numbers.\r\n- Base-10 is common, likely due to humans having 10 fingers (digits).\r\n\r\n*The base of a number is indicated by a subscript. By default they are 10.*\r\n",
  "Digit Position Weight in Decimal System": "## Digit Position Weight in Decimal System\r\n- Each digit position has a weight, based on powers of 10.\r\n- Position to the left of the radix point multiplied by increasing powers of 10.",
  "Binary Numerals (Base-2)": "## Binary Numerals (Base-2)\r\n- Binary uses two unique digits (0, 1), known as bits (binary digits).\r\n- Similar positional weighting scheme to decimal, but base is 2.\r\n- Increasing powers of 2 from the radix point to the left, and decreasing to the right.\r\n## Counting in Binary\r\n- Counting in binary from 0 to 15 using 4 bits.\r\n- Most significant bit (MSB): leftmost bit (carries largest weight).\r\n- Least significant bit (LSB): rightmost bit.\r\n## Patterns in Binary Sequences\r\n- Identifying patterns such as alternating zeros and ones with doubling periodicity for each digit position moving left.\r\n- Digital design is often about recognizing and leveraging such patterns.\r\n\r\n",
  "Converting Binary To Decimal": "## Converting Binary To Decimal\r\n1. Write the binary number, spacing out each bit.\r\n2. Write the weights under each bit, which are powers of 2 starting from 0 moving left.\r\n3. Multiply each bit by its weight.\r\n    - If the bit is 0, the result is 0 (ignore these in the next step).\r\n    - If the bit is 1, the result is the weight value itself.\r\n4. Add the non-zero results to get the decimal equivalent.\r\n\r\n### Fraction Conversion\r\n- Convert binary fractions by using negative powers of 2 starting from the radix point.\r\n- The first position to the right of the radix point has a weight of \\`2^-1\\`, decreasing by 1 for each subsequent position.\r\n                ",
  "Decimal To Binary": "## Decimal To Binary\r\n### Shorthand Sum-of-Weights Method (for Integers)\r\n\r\n- **Method Overview**: Break down the decimal number into powers of 2, and create a binary number with '1's where those powers exist and '0's elsewhere.\r\n\r\n**Begin the sum with the power of 2 just below the decimal number.**\r\n\r\n### Repeated Divide-by-2 Method (for Integers)\r\n\r\n**Steps**:\r\n1. Draw a table with two columns; 'quo' (quotient) and 'rem' (remainder).\r\n2. Divide the decimal number by 2, write down the quotient and remainder.\r\n3. Repeat dividing the updated quotient by 2 and noting the new quotient and remainder until you reach a quotient of 0.\r\n4. Read the binary from the 'rem' column from bottom (most significant bit) to top (least significant bit).\r\n\r\n\r\n### Repeated Multiply-by-2 Method (for Fractions)\r\n\r\n**Steps**:\r\n1. Draw a two-column table with 'mant' (mantissa, representing the fraction) and 'cant' (carry, the whole number part).\r\n2. Multiply the fraction by 2, place the fraction part in 'mant' and the whole number part in 'cant'.\r\n3. Repeat the multiplication for 'mant' by 2 and separating the resulting carry.\r\n4. The binary fraction is obtained by reading the 'cant' column from top (immediately after the binary point) to bottom.\r\n"
}