{
  "Binary Coded Decimal (BCD)": "## Binary Coded Decimal (BCD)\r\n- BCD stands for Binary Coded Decimal.\r\n- It is used to translate decimal numbers into 4-bit binary words.\r\n- Each decimal digit is represented by a 4-bit binary word.\r\n- The most commonly used BCD is the 8421 scheme, which corresponds with hexadecimal for digits 0-9.\r\n- BCD does not represent decimal values higher than 9 with a single 4-bit word, hence values from \\`1010\\` (10 decimal) to \\`1111\\` (15 decimal) are invalid in BCD.\r\n- Example Conversion:\r\n  - Decimal 463 to BCD:\r\n    - 4 -> \\`0100\\`\r\n    - 6 -> \\`0110\\`\r\n    - 3 -> \\`0011\\`\r\n- BCD addition can be tricky because you might end up with an invalid BCD digit which requires adjustment by adding the binary code for decimal 6.\r\n- BCD makes conversion very quick without the need for repeated division.\r\n\r\n## Gray Code\r\n- Also known as reflected binary code or minimum error code.\r\n- It is an unweighted binary code.\r\n- A 4-bit word represents numbers between 0 and 15.\r\n- The key feature of Gray code is that only one bit changes between consecutive numbers.\r\n- Gray code prevents glitches when used in digital counters because only one bit changes, reducing the chances of a temporary incorrect count.\r\n\r\n## ASCII (American Standard Code for Information Interchange)\r\n- Represents 128 common symbols and control operations with a 7-bit code, often with an 8th bit for error detection.\r\n- Allows for communication between different computer systems.\r\n- Example:\r\n  - Capital \"M\" -> Hex \\`4D\\` -> Binary \\`1001101\\`\r\n- ASCII can represent characters and control operations like \\`Tab\\` and \\`Escape\\`.\r\n\r\n## Error Detection - Parity Bits\r\n- Technique to identify data transmission errors.\r\n- Choose even or odd parity.\r\n- Include an extra lead bit before the data that makes the total number of '1's in the packet even (or odd for odd parity).\r\n- The receiving machine checks and counts the '1's to determine if there were errors during transmission.\r\n- Simple but not foolproof; cannot detect all errors nor correct them.\r\n\r\n## Unicode\r\n- Extends beyond ASCII with the intent to encode all written characters used in any language in the world.\r\n- Contains over 140,000 characters.\r\n- ASCII is a subset of Unicode."
}